//Лабораторная 2, задача 17. Выполнена: Подвальников А.С.
/*Есть два стола :D
В прямоугольной комнате W на H стоит прямоугольный стол стороны которого
параллельны сторонам комнаты. Нижний левый угол стола находится в точке
(x1, y1), а верхний правый в точке (x2, y2). Вы хотите поставить в эту комнату
ещё один прямоугольный стол с шириной w и высотой h так, чтобы сторона,
соответствующая ширине стола, была параллельна стороне комнаты,
соответствующей её ширине. (столы могут касаться друг друга, но не могут
иметь общей площади).
На какое минимальное расстояние нужно сдвинуть первый стол так,
чтобы в комнату можно было поставить второй стол? Поворачивать столы
- запрещено. В расчётах используется Декартова (от Рене Декарт) система
координат. */
#include <iostream>
#include <cmath>

using namespace  std;

int main()
{
    double W,H,x1,y1,x2,y2,w,h,D;
    cin >> W >> H >> x1 >> y1 >> x2 >> y2 >> w >> h;

    return 0;
}