//Лабораторная 2, задача 12. Выполнена: Подвальников А.С.
/*Определить, попадает ли круг с точкой в центре которая имеет
координату M1(x1, y1) и радиусом r в круг с точкой в центре которая имеет
координату M2(x2, y2) и радиусом R. Если круг M1 попадает в круг M2, вывести
сообщение “Да”. Если круг M2 попадает в круг M1 вывести сообщение “Да, но
справедливо обратное для двух фигур”. Если круги пересекаются, но не
поглощают друг друга, то вывести сообщение “Фигуры пересекаются”. Иначе
вывести сообщение “Ни одно условие не выполнено”.*/
#include <iostream>

using namespace std;

int main()
{
    double x1,y1,x2,y2,r,R;
    cin >> x1 >> y1 >> x2 >> y2 >> r >> R;

}

